app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
    @movies = @movies.paginate(page: params[:page], per_page: 2)
---
SELECT "movies".* FROM "movies"
SELECT COUNT(*) FROM "movies"

  def show
    @reviews = Review.where(:movie_id =>@movie.id).order("created_at desc")
    if @reviews.blank?
      @avg_review = 0
    else
      @avg_review = @reviews.average(:rating).round(2)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? ORDER BY created_at desc  [["movie_id", 1]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]

  def create
    @movie = current_user.movies.build(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("name", "description", "director", "rating", "created_at", "updated_at", "user_id", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @movie.update(movie_params)
---
UPDATE "movies" SET "available_date" = ?, "available_time" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["available_date", "2018-07-24 00:00:00"], ["available_time", "2000-01-01 06:00:00"], ["updated_at", "2018-07-24 11:15:37.037016"], ["id", 4]]

  def available_theater
    @theaters=Theater.all
---
SELECT  "theaters".* FROM "theaters" ORDER BY "theaters"."id" DESC LIMIT ?  [["LIMIT", 1]]