app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "movie_id") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 3], ["comment", "Amazing movie"], ["created_at", "2018-07-18 06:21:03.942076"], ["updated_at", "2018-07-18 06:21:03.942076"], ["user_id", 1], ["movie_id", 1]]
---
  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.movie_id = @movie.id
    respond_to do |format|
      if @review.save