app/controllers/theaters_controller.rb

	def index
		@theaters= Theater.all
---
SELECT "theaters".* FROM "theaters"

	def create
		@theater=Theater.new(theater_params)
		if @theater.save
---
INSERT INTO "theaters" ("name", "time", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "INOX: Central, JP Nagar, Mantri Junction"], ["time", "2018-07-30 03:15:00"], ["movie_id", 1], ["created_at", "2018-07-30 10:29:43.469571"], ["updated_at", "2018-07-30 10:29:43.469571"]]