app/views/theaters/_form.html.erb

SELECT "movies".* FROM "movies"
---
		<%=f.label :movie_id %>
		<%=f.collection_select :movie_id ,Movie.all,:id,:name , {prompt: "Select a Theater"},{class: "form-control"} %>